{
  "SINGLE_ARM_ROW": {
    "youtubeVideoId": "dFzUjzfih7k",
    "steps": [
      "Grab the dumbbell with one hand, and support your body with the other hand on a flat bench",
      "Hips should be bend so the torso is parallel with the floor, arm hanging down towards the floor - this is the starting position.",
      "Initiate the pull by keeping your elbow as tight to your body as possible, driving the elbow back towards your hip.",
      "It is not recommended to pause at the top.",
      "Just focus on squeezing the lat, and then lowering the weight as controlled as possible down towards the ground - but don't rest the weight on the floor",
      "Do 3-4 sets of 8-10 reps." 
    ]
  },
  "BENT_OVER_DUMBBELL_ROW": {
    "youtubeVideoId": "6TSP1TRMUzs",
    "steps": [
      "While holding a dumbbell in each hand lean forward until your torso is parallel with the floor.",
      "Begin the movement by driving the elbows back while retracting the shoulder blades.",
      "Slowly lower the dumbbells back to the starting position.",
      "Do 3-4 sets of 10-12 reps"
    ]
  },
  "LAT_PULLDOWN": {
    "youtubeVideoId": "CAwf7n6Luuc",
    "steps": [
      "Attach a wide grip handle to the lat pulldown machine.",
      "Grasp the handle with a wide grip parallel to shoulders.",
      "Start by pulling the handle towards your body until the elbows are in line with your torso and then slowly lower the handle back to the start position.",
      "Do 3-4 sets of 12-15 reps."
    ]
  },
  "SEATED_CABLE_ROW": {
    "youtubeVideoId": "GZbfZ033f74",
    "steps": [
      "Sit on the row machine with a close grip bar attach to it.",
      "Grasp the bar, bend your legs slightly and put your back straight.",
      "With this position in still pull the bar to your stomach",
      "Pull your shoulder blades back; squeeze and pause, then lower the weight back to the starting position.",
      "Do 3-4 set of 12-15 reps."
    ]
  },
  "DEADLIFT": {
    "youtubeVideoId": "-4qRntuXBSc",
    "steps": [
      "Make sure your lower back is neutral, not rounded as rt is very dangerous.",
      "Keep the bar close to your body constantly.",
      "Allowing it to roll away will put your back under more stress and will make it harder to go heavy",
      "The bar should almost literally roll up your shins as you begin the lift.",
      "Keep your arms straight at all the times, and if you don't, you bend them, you can tear a bicep.",
      "Keep your core and your last tight dunng the lift as this helps prevent the lower back from rounding."
    ]
  },
  "DUMBBELL_CURL": {
    "youtubeVideoId": "ykJmrZ5v0Oo",
    "steps": [
      "Stand straight with feet shoulder width apart, and hold a dumbbell on both hands facing in-front.",
      "Bend your elbows and lift both the dumbbells up towards your shoulder level.",
      "After reaching shoulder level, curl your wrists inwards for a final squeeze at the top of the movement.",
      "Return slowly to the starting position.",
      "Do 3-4 set of 10-15 reps."

    ]
  },
  "HAMMER_CURL": {
    "youtubeVideoId": "zC3nLlEvin4",
    "steps": [
      "Stand straight with feet shoulder width apart, and hold a dumbbell on both hands facing your torso.",
      "Slowly lift both the dumbbells up towards your shoulder level while keeping your wrists in a fixed position.",
      "Do not curl or twist the dumbbells at any point.",
      "At the top position, try to focus an placing peak tension an your biceps.",
      "Return slowly to the starting position.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "BARBELL_CURL": {
    "youtubeVideoId": "QZEqB6wUPxQ",
    "steps": [
      "Stand straight with feet shoulder width apart, and hold a barbell with shoulder width apart.",
      "Bend your knees slightly and pull your shoulders back.",
      "Pull the barbell up to your chest while keeping your elbows tucked in.",
      "At the top position, pause for 1 to 2 seconds.",
      "Return slowly to the starting position.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "TRICEPS_BENCH_DIPS": {
    "youtubeVideoId": "c3ZGl4pAwZ4",
    "steps": [
      "Place a bench or chair behind your back in a perpendicular position to your body.",
      "Grab the edge of the bench with your hands fully extended and kept at a distance af your shoulder width.",
      "Extend your legs forward so that your legs are at 90 degrees to your torso.",
      "Lower your body by bending at your elbows until your upper arms makes an angle slightly lesser than 90 degrees with forearm.",
      "Return slowly up ta the starting position.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "STANDING_OVERHEAD_CABLE_TRICEPS_EXTENSION": {
    "youtubeVideoId": "GzmlxvSFE7A",
    "steps": [
      "Attach a rope to a cable above your head.",
      "Grab the rope overhead with a neutral grip (palms facing), and lean forward by hinging at the hips.",
      "Initiate the movement by extending the elbows and flexing the triceps.",
      "Pull the rope downward until your elbows are almost locked out and then slowly lower under control back to the starting position.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "CABLE_ROPE_TRICEPS_PUSHDOWN": {
    "youtubeVideoId": "kiuVA0gs3EI",
    "steps": [
      "Attach a rope to a cable machine.",
      "Grab the rope and stand with ane foot forward for balance.",
      "Push the rope down by extending your triceps and hold far 1 to 2 seconds. Do not lock your elbows.",
      "Slowly extend your forearms back up until they are parallel to the floor.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "CHEST_DIPS": {
    "youtubeVideoId":"dX_nSOOJIsE",
    "steps": [
      "Lean forward.",
      "Put your elbows a little bit wider than your shoulders.",
      "Move knees slightly forward, so your body is shaped like a \"C\".",
      "Contract your abs to maintain the position.",
      "Keep your head in line with your spine as you go down.",
      "Do 3-4 set of 8-10 reps."
    ]
  },
  "BARBELL_BENCH_PRESS": {
    "youtubeVideoId": "rT7DgCr-3pg",
    "steps": [
      "Lie flat on your back on a bench.",
      "Grip the bar with hands just wider than shoulder-width apart.",
      "Bring the bar slowly down to your chest as you breathe in.",
      "Push up as you breathe out, gripping the bar hard and watching a spot on the ceiling rather than the bar.",
      "Do 3-4 sets af 8-12 reps."
    ]
  },
  "DUMBBELL_FLY": {
      "youtubeVideoId": "eozdVDA78K0",
      "steps": [
        "Lie flat on your back an a bench with dumbbells on your both hands.",
        "Keep your elbows slightly bent, push the hands apart.",
        "Lower the dumbbells down and out to the side and inhale until your hands drop to just below the height af your chest.",
        "Return to the starting position by squeezing your chest and bringing the weights back to the starting position along the same path.",
        "Do 3-4 sets af 8-12 reps."
      ]
  },
  "SEATED_PEC_DECK": {
    "youtubeVideoId": "H4mVGHaK2f4",
    "steps": [
      "Sit an the pec deck machine with your back against the pad.",
      "Grasp the pec deck handles ensuring your upper arms are parallel to the floor.",
      "Push the handles together as you contract your chest in the middle.",
      "Hold this contraction for 1 second.",
      "Allow your chest to stretch out as much as possible as you slowly return the handles to the starting position, arced out by your sides.",
      "Do 3-4 sets af 12-15 reps."
    ]
  },
  "CABLE_CROSS_OVER": {
    "youtubeVideoId": "taI4XduLpTk",
    "steps": [
      "Set up your cable machine with two handles slightly above head height, grasp the handle and take several steps forward with one foot in-front of the other.",
      "Maintain a slight bend in your arm as your drive through the chest to arc the cables down in-front of you.",
      "Pause and contract for 1 second.",
      "Maintaining this bend in your arm begin ta arc your arms outward as wide as passible, returning the cables as far back as possible while contracting the chest.",
      "Do 3-4 sets af 8-10 reps."
    ]
  },
  "DUMBELL_LUNGE": {
    "youtubeVideoId": "3frV3RnPfOY",
    "steps": [
      "Stand straight with feet shoulder width apart, and hold a dumbbell an both hands.",
      "Lunge forward as far as you can with your right leg, bending your trailing knee so it almost touch the floor.",
      "Use the heel of your right fact to push your upper body back to the starting position.",
      "Repeat with the left leg.",
      "Do 3-4 set of 10-15 reps."
    ]
  },
  "BARBELL_SQUAT": {
    "youtubeVideoId": "1oed-UmAxFs",
    "steps": [
      "Set the barbell on the rack with the weight.",
      "Support the barbell on your traps, grab it with both arms and lift it by pushing your legs.",
      "Go down slowly by bending your knees, gradually lower the bar while maintaining a straight posture.",
      "Stand back to the starting position.",
      "Do 3-4 set of 8-10 reps."
    ]
  },
  "LEG_PRESS": {
    "youtubeVideoId": "Aq5uxXrXq7c",
    "steps": [
      "Add weight on both sides of the leg press machine.",
      "Sit on the seat, and place your feet hips-width apart on the footplate.",
      "Press the footplate with both feet as you disengage the safety latches on both sides.",
      "Now bend your knees, letting the footplate comes towards your body.",
      "Once your knees are at 90 degree angle, press the footplate back up and straighten your legs (Do not lock your knees).",
      "Do 3-4 set of 8-10 reps."
    ]
  },
  "LEG_EXTENSIONS": {
    "youtubeVideoId": "YyvSfVjQeL0",
    "steps" : [
      "Select the weight you are comfortable with and insert the pin on the leg extensions machine.",
      "Sit on the seat and position your shin behind the pad.",
      "Take a deep breath and extend your legs as you flex your quadriceps.",
      "Lock the knees, and slowly back to the starting position.",
      "Do 3-4 set of 10-12 reps."
    ]
  },
  "FRONT_RAISES": {
    "youtubeVideoId": "gzDawZwDC6Y",
    "steps": [
       "While standing still hold the dumbbells in your bath hands.",
      "With your elbows slightly bent, raise the dumbbell up in-front of you until your hands are just above your shoulder height.",
      "Lower the dumbbells back down and repeat.",
      "You can do this by raising your both hands at the same time or by raising your hands alternatively.",
      "Do 3-4 set of 15-20 reps (each hand)."
    ]
  },
  "MILITARY_PRESS": {
    "youtubeVideoId": "2yjwXTZQDDI",
    "steps": [
      "Stand straight with the bar holding on front of your shoulder.",
      "Raise the bar over your head, until it is balanced over your shoulders.",
      "Lower the bar back down and repeat.",
      "Do 3-4 set of 10-12 reps."
    ]
  },
  "LATERAL_RAISES": {
    "youtubeVideoId": "geenhiHju-o",
    "steps": [
      "Stand straight with holding dumbbells on both hands and feet shoulder width apart.",
      "Bend your torso slightly and extend your arms on your sides with elbows slightly bent.",
      "Slowly raise bath hands together an your sides until the dumbbells reach your shoulder level.",
      "Then slowly lower your dumbbells back to the starting position.",
      "Do 3-4 set of 10-12 reps."
    ]
  },
  "SHOULDER_PRESS": {
    "youtubeVideoId": "qEwKCR5JCog",
    "steps": [
      "Sit an a bench or chair with back straight and dumbbells on your both hands.",
      "Raise the dumbbells over your head, until they are balanced over your shoulders.",
      "Lower the dumbbells back down and repeat.",
      "Do 3-4 set of 10-12 reps."
    ]
  }
}