{
  "BOUND_ANGLE_FORWARD_BEND": {
    "youtubeVideoId": null,
    "steps": [
      "Get into initial seated position, inhale and bring your feet as close to your groin as possible, with soles touching each other.",
      "As you exhale, bend forward to hold your feet and put them on your thighs.",
      "Put your hands behind your back and hold the position for five breaths.",
      "Slowly, go back into the starting, breath normally."
    ]
  },
  "CHILDS_POSE": {
    "youtubeVideoId": null,
    "steps": [
      "Rest your knees about twa feet apart from one another and touch your big toes to one another.",
      "Sit your hips dawn on your heels.",
      "Rest your forehead on the ground and extend your arms out from the shoulders.",
      "Press your hands into the ground to bring your hips closer to your heels.",
      "Hald to 30 seconds to 5 minutes."
    ]
  },
  "STANDING_BACK_EXTENSION": {
    "youtubeVideoId": null,
    "steps": [
      "Stand with your feet shoulder-width apart.",
      "Put your hands behind your back, on your hips.",
      "Stretch backward slowly as far as possible, while exhaling for 3 seconds, without bending your knees.",
      "Repeat this exercise for 1 to 5 times."
      ]
  },
  "REVOLVED_HEAD_TO_KNEE_POSE_RIGHT": {
    "youtubeVideoId": null,
    "steps": [
      "Sit on the floor with both legs extended, the spine stacked vertically and open the legs as wide as it feels comfortable.",
      "Raise your left arm, lean your torso to the right and try to touch your foot with your left hand.",
      "Stay in this position for 30 seconds, then lean towards left side and do the same.",
      "Repeat this exercise for 1 to 5 times."
    ]
  },
  "REVOLVED_HEAD_TO_KNEE_POSE_LEFT": {
    "youtubeVideoId": null,
    "steps": [
      "Sit an the floor with both legs extended, the spine stacked vertically and open the legs as wide as it feels comfortable.",
      "Raise your right arm, lean your tarso to the left and try to touch your foot with your right hand.",
      "Stay in this position for 30 seconds, then lean towards right side and do the same.",
      "Repeat this exercise for 1 to 5 times."
    ]
  },
  "COBRA_POSE": {
    "youtubeVideoId": null,
    "steps": [
      "Lie on your belly.",
      "Come onto your forearms, with your elbows directly under your shoulders and parallel to each other.",
      "Spread your toes wide and press the tops of your feet into your mat.",
      "Firm your legs, and rall your inner thighs up, your outer thighs down.",
      "Press down into your forearms ta lift your chest up."
    ]
  },
  "EASY_TREE_POSE_RIGHT": {
    "youtubeVideoId": null,
    "steps": [
      "Start in mountain pase with your toes together and heels slightly apart.",
      "Bring your right foot to the inner thigh of your left leg. The lifted knee should be facing ground at 45 degree angle.",
      "Once you've find your balance, lift your hands to prayer position in front of your chest, or up overhead if that feels better for you.",
      "Hold for 5-10 breaths, then switch sides."
    ]
  },
  "EASY_TREE_POSE_LEFT": {
    "youtubeVideoId": null,
    "steps": [
      "Start in mountain pase with your toes together and heels slightly apart.",
      "Bring your left fact to the inner thigh of your right leg. The lifted knee should be facing ground at 45 degree angle.",
      "Once you've find your balance, lift your hands to prayer position in front of your chest, or up overhead if that feels better for you.",
      "Hold for 5-10 breaths, then switch sides."
    ]
  },
  "CRESCENT_LUNGE": {
    "youtubeVideoId": null,
    "steps": [
      "Step your right foot forward between your hands for low lunge.",
      "Point the toes of both feet directly forward.",
      "Press your left heel back and squeeze your leg straight.",
      "Bend into your right leg and stack your knee over your ankle.",
      "Using the strength of your core, reach your hands to the sky with palms facing each other.",
      "Tuck your tailbone under and draw your ribcage in.",
      "Hold this position to 10 to 30 seconds, then change sides."
    ]
  },
  
  "ONE_LEGGED_KING_POSE": {
    "youtubeVideoId": null,
    "steps": [
      "Bring your right knee to the floor.",
      "Lower your left knee to the floor and slide your left leg back. Come onto your fingertips and walk your hands back until they're next to your hips, then lengthen your spine.",
      "Bend your left knees so the toes are pointing towards the sky.",
      "Inhale and reach your right arm towards the sky.",
      "Then exhale, bend the elbow, and grasp the foot.",
      "Stay in this pose for several breaths. Then carefully release your hands and lower your foot.",
      "Place your palms on the floor then change sides."
    ]
  },
  
  "WHEEL_POSE": {
    "youtubeVideoId": null,
    "steps": [
      "Begin on your back with your feet planted hip-distance apart and your palms planted by your ears.",
      "Engage the back side af your body to support the opening in the front side.",
      "Use your exhale breath to press into your palms and feet as you lift your hips and heart skyward.",
      "Externally rotate your shoulders towards your face to create more length.",
      "Press equally through your hands and feet but also use your legs far more leverage."
    ]
  },
  
  "TRIANGLE_POSE_RIGHT": {
    "youtubeVideoId": null,
    "steps": [
      "Extend your right hand towards the front af the room, keeping your right hip tucked.",
      "Lower your right hand down onto your shin or ankle. Bring your right hand to the floor on the inside or on the right fact.",
      "The left shoulder stacks on top of the right one as you open up your chest.",
      "Turn your head to take your gaze up towards your left fingertips.",
      "Continue to draw your right thigh muscles upward.",
      "Soften your right knee slightly to prevent hyper-extension.",
      "Stay in this position for 5 to 10 breaths, then repeat the pose with your left leg forward."
    ]
  },
  
  "TRIANGLE_POSE_LEFT": {
    "youtubeVideoId": null,
    "steps": [
      "Extend your left hand towards the front of the room, keeping your left hip tucked.",
      "Lower your left hand down anto your shin or ankle. Bring your left hand to the floor on the inside or on the left foot.",
      "The right shoulder stacks an top af the left one as you open up your chest.",
      "Turn your head to take your gaze up towards your right fingertips.",
      "Continue to draw your left thigh muscles upward.",
      "Soften your left knee slightly to prevent hyper-extension.",
      "Stay in this position for 5 to 10 breaths, then repeat the pose with your left leg forward."
    ]
  },
  
  "BOUND_TRIANGLE_POSE_RIGHT": {
    "youtubeVideoId": null,
    "steps": [
      "From extended side angle, extend your top hand to the sky, then wrap it behind your back into the crease of your hip.",
      "Feed your bottom hand under your front thigh to reach for opposite fingers then clasp hands.",
      "Firm your back leg, press your hips forward as your chest and torso rotate towards the sky, then begin to extend your front leg until it is completely straight.",
      "Draw your knee caps up and activate your toes.",
      "Bring your gaze over your top shoulder.",
      "Stay in this position for 5 to 10 breaths, then repeat the pose on your left side."
    ]
  },
  
  "BOUND_TRIANGLE_POSE_LEFT": {
    "youtubeVideoId": null,
    "steps": [
      "From extended side angle, extend your top hand to the sky, then wrap it behind your back into the crease of your hip.",
      "Feed your bottom hand under your front thigh to reach for opposite fingers then clasp hands.",
      "Firm your back leg, press your hips forward as your chest and torso rotate towards the sky, then begin to extend your front leg until it is completely straight.",
      "Draw your knee caps up and activate your toes.",
      "Bring your gaze over your top shoulder.",
      "Stay in this position for 5 to 10 breaths, then repeat the pose on your right side."
    ]
  }
}